#### Import libraries

In [1]:
import pandas as pd

#### Create DataFrame

In [2]:
data = {'name': ['Theresa', 'David', 'Gordon', 'Tony', 'John'],
        'colour': ['Blue', 'Blue', 'Red', 'Red', 'Blue'],
        'score1': [1, 5, 5, 3, 5],
        'score2': [None, 3, 7, 5, 7],
        'score3': [None, 5, 6, 9, None]}

df = pd.DataFrame(data)
df

  colour     name  score1  score2  score3
0   Blue  Theresa       1     NaN     NaN
1   Blue    David       5     3.0     5.0
2    Red   Gordon       5     7.0     6.0
3    Red     Tony       3     5.0     9.0
4   Blue     John       5     7.0     NaN

#### Limit column selection

In [11]:
df[['name', 'colour']]

      name colour
0  Theresa   Blue
1    David   Blue
2   Gordon    Red
3     Tony    Red
4     John   Blue

#### Filter on values in a column

In [5]:
df[df['score1'] >= 3]

  colour    name  score1  score2  score3
1   Blue   David       5     3.0     5.0
2    Red  Gordon       5     7.0     6.0
3    Red    Tony       3     5.0     9.0
4   Blue    John       5     7.0     NaN

#### Filter column and limit selection

In [8]:
df[df['score1'] >= 1][['name', 'colour']]

      name colour
0  Theresa   Blue
1    David   Blue
2   Gordon    Red
3     Tony    Red
4     John   Blue

#### Return a Series as a DataFrame

In [12]:
# We can return a single column (a Series) using double square brackets
df[['name']]

      name
0  Theresa
1    David
2   Gordon
3     Tony
4     John